---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarInstanceBarModelDiameter
source: html/4b0c1b11-e6eb-dac9-5b4a-a7a282ec446c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarInstanceBarModelDiameter Property

"Model Bar Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarInstanceBarModelDiameter { get; }
```